--------------------------------------------------------------------------------------
-- @class file
-- @name main.lua
--------------------------------------------------------------------------------------
-- @author Shuenhoy
-- @copyright Shuenhoy (C)
-- @release 这个文件由HoGE自动生成,请按照您的需要进行修改
--------------------------------------------------------------------------------------

global_init()
global_manager.scene=Scene_Map:new()

--------------------------------------------------------------------------------------
-- @class function
-- @name Update
--------------------------------------------------------------------------------------
-- @description 逻辑刷新函数
-- @param 无
-- @return 无
--------------------------------------------------------------------------------------
function Update()
	global_manager.scene:update()
	sleep(0.05)
end


--------------------------------------------------------------------------------------
-- @class function
-- @name Event
--------------------------------------------------------------------------------------
-- @description 事件函数
-- @param msg事件变量
-- @return 无
--------------------------------------------------------------------------------------
function Event(msg)
	if msg.type == HoGE.KEYDOWN then
		if msg.KeyCode==19 then
			os.execute("pause")
		end
	end
	
	--	o:moveto(p.x,o.y)
	
end
--开始主循环
HoGE.Loop()
